Reports/ВремяУходаИПриходаОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ВремяУходаИПриходаОбучающихся</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ВремяУходаИПриходаПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВремяУходаИПриходаПроживающих</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Общежитие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Общежития</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СколькоГостей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяВозвращенияВОбщежитие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяУходаИзОбщежития</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ВремяУходаИПриходаОбучающихся/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	Отчет();
КонецПроцедуры

&НаСервере
Процедура Отчет()
	//1. Предварительный этап
	Табдок = ТабличныйДокумент; // указываем тил выходных данных
	Табдок.Очистить(); // очищаем на случай повторной формировки
	Табдок.ТолькоПросмотр = Истина; //даем право только на просмотр

	//2. Получаем созданный ранее макет с помощью вспомогательной процедуры:
	Макет = ПолучитьМакетНаСервере("Макет");

	//2.1. Получаем области макета и выводим их
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	Табдок.Вывести(ОбластьЗаголовок);

	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабДок.Вывести(ОбластьШапка);                          
	ОбластьДанные = Макет.ПолучитьОбласть("ОбластьДанных"); 
	                                                     
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
    "ВЫБРАТЬ
    |	ВремяУходаИПриходаПроживающихСрезПоследних.Период КАК Дата,
    |	ВремяУходаИПриходаПроживающихСрезПоследних.Студент КАК Студент,
    |	ВремяУходаИПриходаПроживающихСрезПоследних.ВремяВозвращенияВОбщежитие КАК ВремяВозвращения,
    |	ВремяУходаИПриходаПроживающихСрезПоследних.ВремяУходаИзОбщежития КАК ВремяУхода
    |ИЗ
    |	РегистрСведений.ВремяУходаИПриходаПроживающих.СрезПоследних(&ДатаОтчета, ) КАК ВремяУходаИПриходаПроживающихСрезПоследних
    |
    |СГРУППИРОВАТЬ ПО
    |	ВремяУходаИПриходаПроживающихСрезПоследних.Студент,
    |	ВремяУходаИПриходаПроживающихСрезПоследних.Период,
    |	ВремяУходаИПриходаПроживающихСрезПоследних.ВремяВозвращенияВОбщежитие,
    |	ВремяУходаИПриходаПроживающихСрезПоследних.ВремяУходаИзОбщежития
    |
    |УПОРЯДОЧИТЬ ПО
    |	Дата,
    |	ВремяУхода";                                     	
	ЗапросДанных.УстановитьПараметр("ДатаОтчета",КонецДня(ЭтаФорма.ДатаОтчета));
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	
	Пока ВыборкаДанных.Следующий() Цикл            
		ОбластьДанные.Параметры.Студент = ВыборкаДанных.Студент;
		ОбластьДанные.Параметры.Дата = ВыборкаДанных.Дата;
		ОбластьДанные.Параметры.ВремяУхода = ВыборкаДанных.ВремяУхода;
		ОбластьДанные.Параметры.ВремяВозвращения = ВыборкаДанных.ВремяВозвращения;

		Табдок.Вывести(ОбластьДанные);
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.МасштабПечати = 100; // это значит что масштаб будет 100 процентов

	ТабДок.РазмерСтраницы = "A4";
	ТабДок.ТочностьПечати = ТочностьПечати.Точная;
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере(ИмяМакета)
	
	ЭО = РеквизитФормыВЗначение("Отчет");
	Макет = ЭО.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
	
КонецФункции
